1. CakePHPの2系・3系の違い
CakePHP2はComposerでのインストールに対応していなかったことに対して、CakePHP3はComposerで簡単にインストールすることができるようになった。
モデル周りの構成や、DBからデータを取得する際のコードも比較的簡単になった。

2. LAMP
データベースを利用したWebアプリケーションを開発・運用するのに適した人気の高いオープンソースソフトウェアの組み合わせの一つでOSの「Linux」、Webサーバの「Apach」、データベースの「MySQL」(後にMariaDBも追加された)、プログラミング言語および実行環境の「PHP」「Perl」「Python」(のいずれか)の頭文字をつないだもの。
動的なWebサイトやWebサービスなどの構築に適しており、関連情報や事例も豊富。

3. AWS
Amazonが提供しているクラウドサービスの総称。
レンタルサーバ、データベース、ストレージを利用したデータの保存、バックアップを始め、ソフトウェアのオンデマンド配信、IoTシステムの構築、機械学習、画像認識といったAmazonが保有する最新の技術を利用することができる。